Revit 2024 API
SolidCurveIntersection Class
 This class represents the results of a calculation of intersection between a solid volume and a curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class SolidCurveIntersection : IEnumerable<Curve>,
	IDisposable
Visual Basic
Public Class SolidCurveIntersection _
	Implements IEnumerable(Of Curve), IDisposable
Visual C++
public ref class SolidCurveIntersection : IEnumerable<Curve^>,
	IDisposable
Remarks
 The results contain a collection of curves and a collection of curve extents (which are the parameters of intersection from the original input curve). Depending on the SolidCurveIntersectionMode option passed when executing the calculation, the curve segments and curve extents represent either the extents of the curve which exist inside the solid, or the extents of the curve which exist outside the solid. If the curve is entirely inside the solid, and the option is CurveSegmentsOutside, or if the curve is entirely outside the solid, and the option is CurveSegmentsInside, this results object will be empty. Note that curves aligned with the bounding faces of the solid are considered to be inside by this utility.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SolidCurveIntersection
See Also
SolidCurveIntersection Members
Autodesk.Revit.DB Namespace